<?php

/**
 * CakePHP(tm) : Rapid Development Framework (http://cakephp.org)
 * Copyright (c) Cake Software Foundation, Inc. (http://cakefoundation.org)
 *
 * Licensed under The MIT License
 * For full copyright and license information, please see the LICENSE.txt
 * Redistributions of files must retain the above copyright notice.
 *
 * @copyright Copyright (c) Cake Software Foundation, Inc. (http://cakefoundation.org)
 * @link      http://cakephp.org CakePHP(tm) Project
 * @since     0.2.9
 * @license   http://www.opensource.org/licenses/mit-license.php MIT License
 */

namespace App\Controller;

use App\Controller\AppController;
use Cake\ORM\TableRegistry;
use Cake\Mailer\Email;

/**
 * Static content controller
 *
 * This controller will render views from Template/Pages/
 *
 * @link http://book.cakephp.org/3.0/en/controllers/pages-controller.html
 */
class PagesController extends AppController {

    public function index() {
        return $this->redirect(['action' => 'contact']);
    }

    public function advantages() {
        $data = [
            [
                'title'=>' ผู้ขายหลายคนได้ลองลงประกาศขายทรัพย์สินทางอินเตอร์เน็ท แต่ผลปรากฏว่ามีแต่โบรกเกอร์โทรมาหาหรือมีบางรายแค่โทรมาสอบถามแล้วก็หายไป ไม่เห็นว่าจะมีผู้ซื้อคนใดที่จะสนใจซื้อจริงๆ ผู้ขายหลายคนคงเคยสงสัยว่า จะลงประกาศอย่างไร หรือลงเว็บไหนถึงจะมีผู้สนใจเข้ามาสอบถามเยอะๆ',
                'content'=>'ทางทีมงานได้ประชาสัมพันธ์ทางอินเตอร์เน็ทด้วยการทำ sem(google adwords),และทำseo(Search Engine Optimization) ไปพร้อมกัน เพื่อเป็นการประชาสัมพันธให้เว็บไซด์ของทางทีมงานติดอันดับหน้าแรกๆของGoogle เพราะผู้ซื้อร้อยละ 80-90% จะหาซื้อบ้าน-ที่ดินด้วยการSearch หาข้อมูลจากGoogleเช่นคำว่า บ้านมือสอง,ขายบ้านมือสอง,<strong><i><a href="http://www.lovethaihome.com">ซื้อบ้าน</i></strong></a>,ขายบ้าน,<strong><i><a href="http://www.lovethaihome.com/asset-order/sales">ฝากขายบ้าน</i></strong></a>,<strong><i><a href="http://www.lovethaihome.com/asset-order/sales">ฝากขายที่ดิน</i></strong></a>,<strong><i><a href="http://www.lovethaihome.com/asset-order/sales">ฝากขายคอนโด</i></strong></a>,<strong><i><a href="http://www.lovethaihome.com/asset-order/sales">ต้องการฝากขายบ้าน</i></strong></a>,<strong><i><a href="http://www.lovethaihome.com/asset-order/sales">ต้องการฝากขายที่ดิน</i></strong></a>,หาบ้าน,<strong><i><a href="http://www.lovethaihome.com">บ้านเดี่ยวมือสอง</i></strong></a>,คอนโดมือสอง,ทาวน์เฮ้าส์มือสอง,<strong><i><a href="http://www.lovethaihome.com/assets/lists?selltype=special_marketprice">บ้านราคาถูก</i></strong></a>,<strong><i><a href="http://www.lovethaihome.com/assets/lists?selltype=special_marketprice">ที่ดินราคาถูก</i></strong></a>,คอนโดราคาถูก,<strong><i><a href="http://www.lovethaihome.com/assets/lists?selltype=special_appraised">บ้านขายต่ำกว่าประเมิน</i></strong></a>,<strong><i><a href="http://www.lovethaihome.com/assets/lists?selltype=special_appraised">ที่ดินขายต่ำกว่าประเมิน</i></strong></a>,<strong><i><a href="http://www.lovethaihome.com/assets/lists?selltype=special_marketprice">ขายบ้านต่ำกว่าราคาตลาด</i></strong></a>,<strong><i><a href="http://www.lovethaihome.com/assets/lists?selltype=special_marketprice">ขายที่ดินต่ำกว่าราคาตลาด</i></strong></a>,<strong><i><a href="http://www.lovethaihome.com/">โบรกเกอร์ขายบ้าน</i></strong></a>,<strong><i><a href="http://www.lovethaihome.com/">โบรกเกอร์ขายที่ดิน</i></strong></a>,<strong><i><a href="http://www.lovethaihome.com/">นายหน้าขายบ้าน</i></strong></a>,<strong><i><a href="http://www.lovethaihome.com/">นายหน้าขายที่ดิน</i></strong></a>,<strong><i><a href="http://www.lovethaihome.com/">บริษัทขายบ้านมือสอง</i></strong></a>,ซื้อ-ขายบ้านที่หมู่บ้าน....,ซื้อ-ขายบ้านซอย...., เป็นต้น ซึ่งถ้าทางผู้ซื้อได้ Search คำเหล่านี้ก็จะเจอเว็บไซค์ <strong><i><a href="http://www.lovethaihome.com/">www.lovethaihome.com</i></strong></a> ของทางทีมงานเราที่ได้ประชาสัมพันธ์ผ่านทาง google adwords และทำ seo เพื่อให้เว็บของทีมงานขึ้นอยู่ในหน้าแรกๆของ Google เพราะฉะนั้นแล้วเมื่อมีผู้เห็นเว็บไซด์ของทีมงานเรามากขึ้นเท่าใด โอกาสที่จะขายให้ได้ไว และได้ราคาก็ย่อมมากขึ้นเท่านั้น'
            ],
            [
                'title'=>'ผู้ขายไม่ทราบว่าควรจะตั้งราคาขายทรัพย์สินเท่าไหร่ถึงจะเหมาะสม',
                'content'=>'ทางทีมงานจะช่วยวิเคราะห์หา <strong><i><a href="http://www.lovethaihome.com/assets/lists?selltype=special_marketprice">ราคาตลาด</i></strong></a> ในการตั้งราคาขายที่เหมาะสม เพราะว่าถ้าตั้งราคาขายสูงเกินไปก็จะทำให้ไม่มีใครสนใจที่จะถามซื้อหรือถ้าตั้งราคาขายต่ำเกินไปก็จะทำให้ทางผู้ขายได้รับเงินจากการขายน้อยกว่าที่ควรจะได้ ด้วยประสบการณ์ในการขายของทีมงานมากกว่า26ปี และขายทรัพยสินไปแล้วไม่ต่ำกว่า5,000รายการ ทางทีมงานจึงมีข้อมูลในการตั้งราคาขายที่เหมาะสม'
            ],
            [
                'title'=>'ผู้ขายหลายคน อยากจะปรับปรุงสภาพบ้านก่อนที่จะขาย เพื่อให้ได้ราคาที่สูงขึ้น แต่ไม่รู้ว่าควรจะปรับปรุงตรงไหนอย่างไร และกลัวว่าถ้าปรับปรุงไปแล้วเวลาขายได้จะได้ราคาเพิ่มขึ้นคุ้มค่าต่อการลงทุนหรือไม่',
                'content'=>'ทางทีมงานจะช่วยแนะนำเกี่ยวกับวิธีการปรับปรุงสภาพบ้าน เพื่อเตรียมพร้อมสำหรับการขาย ทำให้ง่ายต่อการตัดสินใจซื้อและขายได้ราคาที่สูงขึ้นกว่าที่จะขายในสภาพเดิม'
            ],
            [
                'title'=>'ผู้ขายบางคนได้รับเงินวางมัดจำจากผู้จะซื้อซึ่งต่อมาภายหลังถึงได้รู้ว่าผู้ซื้อที่วางมัดจำไว้แล้วซื้อไม่ได้ต้องเสียเวลาเป็นเดือน แล้วพอโทรตามผู้ซื้อที่เคยสนใจซื้อด้วยเงินสดหรือที่มีเครดิตดี ๆ ก็ปรากฏว่าไปซื้อที่อื่นเรียบร้อยแล้ว หรือจะมีกรณีที่ผู้ซื้อบางรายที่มีเครดิตดี สนใจที่จะซื้อแต่ไม่กล้าวางเงินมัดจำ เพราะกลัวว่าถ้าวางเงินมัดจำแล้วกู้ไม่ผ่านจะโดนยึดเงินมัดจำ ก็เลยไม่กล้าวางเงินมัดจำสักที',
                'content'=>'ทางทีมงานจะมีการวิเคราะห์เครดิตของผู้ซื้อก่อนพาชมบ้านเพื่อตัดปัญหาผู้ซื้อที่ไม่มีความสามารถในการซื้อออกไป ทำให้ทางผู้ขายจะได้ไม่ต้องเสียเวลามาเปิดบ้าน ส่วนในกรณีที่ผู้ซื้อต้องการขอสินเชื่อทางทีมงานจะมีบริการหาสินเชื่อให้กับทางผู้ซื้อ(ฟรี) ซึ่งจะช่วยแก้ปัญหาผู้ที่ซื้อที่ต้องการขอสินเชื่อแต่ไม่รู้ว่าจะเริ่มต้นอย่างไร จะกู้กับกับแบงค์ไหนดี จะได้วงเงินตามที่ตั้งใจอยากได้ไหม สามารถกู้ได้เท่าไร กู้ผ่านไหม กู้ได้ไหม เพราะว่าผู้ซื้อส่วนใหญ่หลายต่อหลายคนอยากซื้อแต่ไม่กล้าวางเงินมัดจำ เพราะกลัวว่าถ้าวางแล้วกู้ไม่ผ่านหรือได้วงเงินน้อยกว่าที่ตั้งใจไว้แล้วก็กลัวว่าจะต้องโดนยึดมัดจำ อนึ่งเนื่องจากว่าทางบริษัทได้มีสถาบันการเงินหลายแห่งได้เข้ามาติดต่อกับบริษัท โดยจะขอประสานกับผู้ซื้อโดยตรง จะทำการเช็คเครดิตก่อนเพื่อให้ผู้ซื้อเกินความมั่นใจว่าสามารถกู้ได้แน่ๆ และได้วงเงินตามความต้องการของผู้ซื้อ ทำให้ทางผู้ซื้อไม่ต้องกลัวว่า ถ้าวางเงินมัดจำแล้วถ้ากู้ไม่ผ่านจะโดนยึดมัดจ'
            ],
            [
                'title'=>'ผู้ขายอยากจะประกาศให้คนทั่วไปที่สนใจซื้อทรัพย์สินของตัวเอง แต่ไม่รู้ว่าจะต้องทำอย่างไร ถึงทำให้รู้ว่ามีทรัพย์สินชิ้นนี้ประกาศขายหรือทำการประชาสัมพันธ์อย่างไร',
                'content'=>'ทางทีมงานจะมีการโฆษณาประชาสัมพันธ์ในทุกๆช่องทาง ตั้งแต่ลงโฆษณาในเว็บไซต์ของเรา <strong><i><a href="http://www.lovethaihome.com/">www.lovethaihome.com</i></strong></a> โดยทางเว็บไซต์ของเราก็ได้ทำ SEO เพื่อให้ง่ายต่อการค้นหาทรัพย์สินต่างๆ และเรายังได้ลงในเว็บไซต์ชั้นนำอื่นๆมากกว่า 15 เว็บไซต์ รวมทั้งมีพนักงานที่คอยอัพข้อมูลให้ตลอดเวลา และเรายังมีการโฆษณา Web Page ใน <strong><i><a href="https://www.facebook.com/lovethaihome1/" target="_blank">Facebook</i></strong></a>,<strong><i><a href="https://www.instagram.com/era_ladprao101/" target="_blank">Instagram</i></strong></a>,<strong><i><a href="https://twitter.com/era_ladprao101" target="_blank">Twitter</i></strong></a>,<a href="http://line.me/ti/p/%40ERA101"><strong><i>Line@</i></strong></a> และยังมีพนักงานช่วยกันขายในบริษัทและเครือข่าย ERA มากกว่า 1,000 คน รวมทั้งมีผู้ซื้อที่รอการซื้ออีกมากมาย ซึ่งองค์ประกอบเหล่านี้จะทำให้ผู้ฝากขายทรัพย์สินไว้กับทางบริษัทจะสามารถขายได้ไวและได้ราคามากกว่าที่ผู้ขาย ขายด้วยตัวเองอย่างแน่นอน'
            ],
            [
                'title'=>'ผู้ขายเคยฝากขายกับโบรกเกอร์หลายแห่งแล้วแต่ขายไม่ได้ หรือกำลังคิดหาบริษัทช่วยขายแต่ไม่รู่ว่าจะฝากขายกับที่ไหนดีถึงจะขายได้ไว และได้ราคาสูง',
                'content'=>'ทางทีมงานของเราเป็นบริษัทขายบ้านในเครือข่ายของERAซึ่งมีสาขาอยู่ทั่วโลก เฉพาะในประเทศไทยมีสาขามากกว่า 30 แห่งทั่วประเทศ ดังนั้นทางทีมงานของเราก็จะประสานงานกับเครือข่ายภายในประเทศ ซึ่งมี<strong><i><a href="http://www.lovethaihome.com/pages/seller">พนักงานขายมืออาชีพ</i></strong></a> ซึ่งผ่านการอบรมจากหน่วยงานของERA มากกว่า1,000คนทั่วประเทศ ซึ่งจะทำให้<strong><i><a href="http://www.lovethaihome.com/">ทรัพย์ที่ฝากขาย</a></i></strong>มีโอกาสในการขายมากกว่าบริษัทขายอสังหาฯที่อื่นๆซึ่งทางบริษัทเหล่านั้นจะมีพนักงานขายเพียงไม่กี่คนที่ช่วยกันขายให้'
            ],
            [
                'title'=>'ผู้ซื้อและผู้ขายส่วนใหญ่ไม่ทราบว่าเวลาไปโอนที่กรมที่ดินต้องมีค่าใช้จ่ายอะไรบ้าง(ธรรมเนียมโอน อากร หรือภาษีธุรกิจเฉพาะ ภาษีเงินได้บุคคล ภาษีเงินได้นิติบุคคล หรือภาษีมรดกหรือรับให้) แล้วมีทางไหนที่จะช่วยลดค่าใช้จ่ายในการโอนดังกล่าวลงได้',
                'content'=>'ทางทีมงานจะคำนวนค่าใช้จ่ายในการโอนให้ทั้งหมด เช่น ธรรมเนียมการโอน,อากร หรือธุรกิจเฉพาะ,ภาษีเงินได้หรือภาษีมรดกหรือรับให้ ดูรายละเอียดได้จาก การคำนวนค่าใช้จ่ายในการโอน โดยทางทีมงานจะหาทางช่วยให้ผู้ที่ต้องจ่ายค่าใช้จ่ายในการโอนให้จ่ายเงินให้น้อยที่สุด ส่วนถ้าผู้ขายต้องการรู้ว่าทรัพย์สิน<strong><i><a href="http://www.lovethaihome.com/assets/lists?selltype=special_appraised">ราคาประเมิน</i></strong></a>เท่าไหร่ ก็ลองเข้าไปดูได้ที่ การคิดราคาประเมินทรัพย์สินของกรมที่ดิน'
            ],
            [
                'title'=>'ผู้ขายหลายคนต้องทำงานทั้งวัน ไม่มีเวลาไปเปิดบ้านให้คนซื้อ พอผู้ขายว่าง คนซื้อก็ไม่ว่างอีก(เวลาไม่ตรงกัน ระหว่างผู้ซื้อกับผู้ขาย) พอคิดจะฝากขายก็กลัวโบรกเกอร์แอบอ้างรับเงินมัดจำแทน หรือพอขายได้ก็ต้องปวดหัว เรื่องการเตรียมเอกสารที่ต้องใช้ในวันโอน เพราะถ้าเอกสารทั้งฝั่งคนซื้อและคนขาย เวลาไปโอนเตรียมเอกสารไม่ครบ ก็โอนกรรมสิทธิ์ไม่ได้เช่นกัน (หลายครั้งที่การโอนยากกว่าการขายด้วยซ้ำ โดยเฉพาะในกรณีที่ต้องมอบอำนาจ มรดก,ขายบ้านแต่ในหนังสือสัญญาซื้อขาย(ท.ด.13) กลับไม่ระบุว่ามีบ้าน,มีผู้ซื้อหรือผู้ขายหลายคน,ผู้ซื้อหรือผู้ขายเป็นในรูปแบบบริษัทหรือนิติบุคคล) โดยส่วนใหญ่แล้วทั้งผู้ซื้อผู้ขายไม่รู้ว่าต้องเตรียมเอกสารอะไรบ้างในการโอนกรรมสิทธิ์',
                'content'=>'ในกรณีที่ผู้ขายไม่มีเวลาเปิดบ้าน ทางทีมงานมีบริการรับฝากกุญแจเพื่อเปิดบ้านแทนให้(ในกรณีที่บ้านหลังนั้นไม่มีคนอยู่) พร้อมทั้งคอยเป็นคนกลางช่วยเจรจาต่อรองให้ทั้ง2ฝ่ายพอใจ และเมื่อตกลงกันได้แล้วก็จัดทำ<strong><i><a href="http://www.lovethaihome.com/documents/%E0%B8%AA%E0%B8%B1%E0%B8%8D%E0%B8%8D%E0%B8%B2%E0%B8%88%E0%B8%B0%E0%B8%8B%E0%B8%B7%E0%B9%89%E0%B8%AD%E0%B8%88%E0%B8%B0%E0%B8%82%E0%B8%B2%E0%B8%A2%E0%B8%AB%E0%B8%A3%E0%B8%B7%E0%B8%AD%E0%B8%AA%E0%B8%B1%E0%B8%8D%E0%B8%8D%E0%B8%B2%E0%B8%A7%E0%B8%B2%E0%B8%87%E0%B9%80%E0%B8%87%E0%B8%B4%E0%B8%99%E0%B8%A1%E0%B8%B1%E0%B8%94%E0%B8%88%E0%B8%B3.pdf">สัญญาจะซื้อจะขาย</i></strong></a>ให้เป็นที่เรียบร้อย โดยทางผู้ซื้อต้องวางเงินมัดจำกับผู้ขายโดยตรง ทางบริษัทจะแค่คอยดูแลเรื่องเอกสารต่างๆที่เกี่ยวกับสัญญาจะซื้อจะขายและจะแนะนำทางผู้ซื้อ และผู้ขายให้เตรียมเอกสารต่างๆที่จะใช้ในวันโอนกรรมสิทธิ์ซึ่งสามารถเข้าไปดูได้ที่ เอกสารที่ใช้ในการโอนกรรมสิทธิ์ และจะช่วยประสานงานการทำนิติกรรมต่างๆ ที่กรมที่ดินจนเป็นที่เรียบร้อย'
            ],
            [
                'title'=>'ผู้ขายหลายคนที่ไม่อยากฝากขาย เพราะกลัวว่าต้องเสียค่าใช้จ่ายหรือกลัวว่าถ้าฝากขายแล้วโบรกเกอร์จะไปบวกราคาแล้วทำให้ขายได้ยากขึ้น',
                'content'=>'กรณีที่ขายไมได้ทางบริษัทจะไม่เรียกเก็บค่าใช้จ่ายใดๆทั้งสิ้น(บริการฟรี)ในกรณีที่ขายได้ ถ้าทรัพย์สินขายได้ในราคามากกว่า 1 ล้านบาท บริษัทจะคิดค่าบริการ3%จากราคาที่ขายได้(ไมใช่ราคาที่ตั้งขาย)แต่ถ้าทรัพย์สินขายได้ต่ำกว่า1ล้าน บริษัทคิดค่าบริการ30,000บาท จ่าย ณ วันที่โอนกรรมที่กรมที่ดิน'
            ],
            [
                'title'=>'จะเริ่มหาทรัพย์สินที่ต้องการซื้ออย่างไร',
                'content'=>'สามารถได้จากการเลือกประเภทของทรัพย์ก่อนแล้วค่อยเลือกโซนต้องการซื้อจากนั้นค่อยคลิกเข้าไปดูรายละเอียดของทรัพย์สินที่สนใจหรือจะหาจากที่ตั้งของทรัพย์สินบนแผนที่ Google ก็ได้ ถ้าสนใจทรัพย์สินรายการไหนก็ค่อยคลิกเข้าไปดูรายละเอียดได้เลยค่ะ'
            ],
            [
                'title'=>'ค้นหาแล้วยังไม่ถูกใจควรทำอย่างไร',
                'content'=>'หากบ้านที่ค้นหาแล้ว ยังไม่ตรงกับความต้องการ ให้ลงทะเบียนความต้องการของท่านไว้ใน <strong><i><a href="http://www.lovethaihome.com/asset-order/purchase">ฝากหาบ้านที่ดิน</i></strong></a>'
            ],
            [
                'title'=>'มั่นใจได้อย่างไรว่าถ้าซื้อทรัพย์สินผ่านบริษัทแล้วจะไม่เกิดปัญหา',
                'content'=>'ทรัพย์ทุกรายการที่<strong><i><a href="http://www.lovethaihome.com/asset-order/sales">ฝากขายกับบริษัท</i></strong></a>ผ่านการตรวจสอบความเป็นเจ้าของกรรมสิทธิ์  และตรวจสอบความพร้อมในการขายได้  ก่อนจะนำมาทำการตลาดให้ผู้ซื้อได้มีโอกาสเห็นการประกาศขายอีกทั้งในเรื่องราคาขายบริษัทก็ช่วยให้คำแนะนำเรื่อง<strong><i><a href="http://www.lovethaihome.com/assets/lists?selltype=special_marketprice">ราคาขาย</i></strong></a>ให้กับเจ้าของ  ทำให้ผู้ซื้อได้ประโยชน์จากการซื้อทรัพย์ที่ฝากขายผ่านบริษัท  สามารถซื้อทรัพย์ที่ซื้อขายได้จริง ๆ และราคาที่ซื้อก็เหมาะสมด้วยค่ะ'
            ],
            [
                'title'=>'ถ้าจะฝากขายต้องทำอย่างไงบ้าง',
                'content'=>'<span class="f-color-red">1.เตรียมเอกสารดังต่อไปนี้</span> <ul><li>- สำเนาโฉนดทุกหน้า</li><li>- ถ้าเป็นที่อยู่อาศัย (สำเนาทะเบียนบ้านหลังที่ขาย) ถ้าเป็นที่ดินไม่ต้องค่ะ</li><li></li><li>- สำเนาบัตรประชาชนของเจ้าของหรือผู้รับมอบอำนาจ</li><li>- ในกรณีที่ได้ทรัพย์มาจากมรดก ขอใบแต่งตั้งผู้จัดการมรดก</li><li>- ถ้าเจ้าของทรัพย์เป็นนิติบุคคล ขอใบจดทะเบียนการค้ากับใบรายงานการประชุม</li></ul> <span class="f-color-red">2. จะให้<a href="http://www.lovethaihome.com/asset-order/sales"><i>เซลล์ติดต่อกลับ</i></a>เพื่อนัดเข้าไปพบ และจะได้นัดหมายเพื่อทำ<strong><i><a href="http://www.lovethaihome.com/documents/%E0%B8%AA%E0%B8%B1%E0%B8%8D%E0%B8%8D%E0%B8%B2%E0%B9%81%E0%B8%95%E0%B9%88%E0%B8%87%E0%B8%95%E0%B8%B1%E0%B9%89%E0%B8%87%E0%B8%95%E0%B8%B1%E0%B8%A7%E0%B9%81%E0%B8%97%E0%B8%99%E0%B8%82%E0%B8%B2%E0%B8%A2.pdf">สัญญาฝากขาย</i></strong></a>แล้วทางบริษัทก็จะเริ่มต้นทำการตลาดได้เลยค่ะ</span>'
            ],
            [
                'title'=>'แล้วถ้าฝากขายกับทางบริษัทแล้วจะมีโอกาสขายได้และจะใช้ระยะเวาในการขายมากน้อยแค่ไหน',
                'content'=>'โอกาสที่จะขายทรัพย์สินได้เมื่อไหร่นั้นขึ้นอยู่กับองค์ประกอบ 2 ส่วน <ul><li>1.<strong><i><a href="http://www.lovethaihome.com/service">การโฆษณาประชาสัมพันธ์</i></strong></a> ซึ่งในส่วนนี้ทางบริษัทได้อธิบายถึงแนวทางในการทำตลาดเอาไว้แล้วข้างต้น ซึ่งมันก็เพียงพอที่จะให้คนทั่วไปที่สนใจซื้อบ้านหรือที่ดินในย่านนั้นรับรู้ว่าเรามีขายทรัพย์นั้นๆ</li><li>2.<strong><i><a href=" http://www.lovethaihome.com/assets/lists?selltype=special_marketprice">ราคาที่ตั้งขาย (ราคาตลาด)</a></i></strong> สาเหตุหนึ่งที่ผู้ขายไม่สามารถขายเองได้ก็เพราะตั้งราคาขายสูงเกินไป เพราะไม่รู้ว่าควรตั้ง<strong><i><a href=" http://www.lovethaihome.com/assets/lists?selltype=special_marketprice">ราคาขายเท่าไรถึงจะเหมาะสม</a></i></strong> ดังนั้นด้วยประสบการณ์ในการทำงานมาเกือบ 30 ปี และมีรายการที่บริษัทขายไปแล้วนับพันนับหมื่นรายการ เราจึงมีฐานข้อมูลของ<strong><i><a href=" http://www.lovethaihome.com/assets/lists?selltype=special_marketprice">ราคาตลาด</a></i></strong> เพื่อใช้ในการประกอบการพิจารณาในเรื่องของ<strong><i><a href=" http://www.lovethaihome.com/assets/lists?selltype=special_marketprice">การหาราคาตั้งขายที่เหมาะสม (ราคาตลาด)</a></i></strong></li></ul>'
            ],
        
        ];
        
        $this->set(compact('data'));
    }

    public function contact() {
        $contactModel = TableRegistry::get('Contacts');
        $contact = $contactModel->newEntity();
        if ($this->request->is('post')) {
            $contact = $contactModel->patchEntity($contact, $this->request->data);
            $result = $contactModel->save($contact);
            if ($result) {
                $this->Flash->success('เราได้รับข้อมูลเรียบร้อยแล้ว ทางทีมงานจะติดต่อกลลับโดยเร็วที่สุด');
                $this->sendemail($contact);
                return $this->redirect(['controller' => CTR_SUCCESS, 'action' => 'index']);
            } else {
                $this->Flash->error(__('The customer has been saved.'));
            }
        }

        $this->set(compact('contact'));
        $this->set('_serialize', ['contact']);
    }

    private function sendemail($contact) {
        if (is_null($contact) || $contact == '') {
            return;
        }
        $settingModel = TableRegistry::get('Settings');
        $settingData = $settingModel->get('0');
        $to = $settingData->email_receiver_contact;
        $title = 'การติดต่อจากลูกค้า';

        $sendEmail = new Email('default');
        $sendEmail->viewVars(['contact' => $contact, 'subject' => $title]);
        $sendEmail->template('contact', 'default')
                ->subject($title)
                ->emailFormat('html')
                ->to($to)
                ->helpers(['Html'])
                ->send();
    }

    public function job() {
        
    }

    public function seller() {
        $SellerModel = TableRegistry::get('Users');

        $query = $SellerModel->find()
                ->contain(['Useimages' => ['Images']])
                ->where(['isseller' => 'Y'])
                ->order(['firstname' => 'ASC']);
        $users = $this->paginate($query, [
            'limit' => 21
        ]);

        $this->set(compact('users'));
        $this->set('_serialize', ['users']);
    }

}
